//! # トレイトオブジェクト
//!
//! トレイトオブジェクトとは、特定のトレイトを満たす任意の型のインスタンスを参照するための型。
//! 共通のトレイトを実装している異なる型を同様に扱うことができるようになる。
//!
//! 何らかのポインタ(参照やヒープ割り当て)を指定し、`dyn`キーワードとトレイトを指定することでトレイトオブジェクトを作成できる。
//!
//! ジェネリックな型引数は一度に1つの具体型にしか置き換えられないのに対して、トレイトオブジェクトは実行時に複数の具体型で埋めることができる。
//!
//! ## 静的ディスパッチ
//!
//! コンパイル時に、トレイトのメソッドの呼び出し先が決定されること。
//!
//! ジェネリクスに対してトレイト制約を使用した場合は、静的ディスパッチになる。
//!
//! ## 動的ディスパッチ
//!
//! 実行時に、トレイトのメソッドの呼び出し先が決定されること。
//!
//! トレイトオブジェクトを使用した場合は、動的ディスパッチになる。
//!
//! ## トレイトオブジェクトにはオブジェクト安全性が必要
//!
//! トレイトオブジェクトはオブジェクト安全なトレイトしか作成できない。
//! コンパイラはトレイトを実装している具体的な型を知らないので、トレイトはオブジェクト安全である必要がある。
//!
//! トレイトは、トレイト内で定義されているメソッド全てに以下の特性があれば、オブジェクト安全になる。
//! - 戻り値の型が`Self`でない
//! - ジェネリックな型引数がない
